MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV32GM004/mcu.h
#define BSS_HIGH             0x8FE9
#define BSS_STNDRD           0x8FED
#define BSS_DISABLED         0x8FEF

#define BSS2_ON              0x8FE7
#define BSS2_OFF             0x8FEF

#define GWRP_ON              0x8FCF
#define GWRP_OFF             0x8FEF

#define GSS_HIGH             0x8F2F
#define GSS_STNDRD           0x8FAF
#define GSS_DISABLED         0x8FEF

#define CWRP_ON              0x8EEF
#define CWRP_OFF             0x8FEF

#define CSS_HIGH             0x81EF
#define CSS_ENHNCD           0x89EF
#define CSS_STNDRD           0x8DEF
#define CSS_DISABLED         0x8FEF

#define AIVTDIS_ENABLE       0x0FEF
#define AIVTDIS_DISABLE      0x8FEF

/* Register FBSLIM (0x5790)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBSLIM;
#define _FBSLIM(x) __attribute__((address(0x5790),deprecated_definition("consider migrating to #pragma config"),section("__FBSLIM.sec"),space(prog))) __prog__ uint16_t _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Code Flash Page Address Limit Bits:
**     BSLIM_BSLIM          Boot Segment Flash Page Address Limit (0-0x1FFF)
**
*/

#define BSLIM_BSLIM          0x0000

/* Register FOSCSEL (0x5798)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0x5798),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Initial oscillator Source Selection Bits:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV16       Internal Fast RC (FRC) Oscillator with divide by 16
**     FNOSC_FRCDIVN        Internal Fast RC (FRC) Oscillator with postscaler
**
**   Two Speed Oscillator Start-Up Bit:
**     IESO_OFF             Start up device with user selected oscillator source
**     IESO_ON              Start up device with FRC,then automatically switch to user selected oscillator source
**
*/

#define FNOSC_FRC            0x0080
#define FNOSC_FRCPLL         0x0081
#define FNOSC_PRI            0x0082
#define FNOSC_PRIPLL         0x0083
#define FNOSC_LPRC           0x0085
#define FNOSC_FRCDIV16       0x0086
#define FNOSC_FRCDIVN        0x0087

#define IESO_OFF             0x0007
#define IESO_ON              0x0087

/* Register FOSC (0x579c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0x579c),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode Select Bits:
**     POSCMD_EC            EC (External Clock) mode
**     POSCMD_XT            XT Crystal Oscillator mode
**     POSCMD_HS            HS Crystal Oscillator mode
**     POSCMD_NONE          Primary Oscillator disabled
**
**   OSC2 Pin I/O Function Enable Bit:
**     OSCIOFNC_ON          OSC2 is general purpose digital I/O pin
**     OSCIOFNC_OFF         OSC2 is clock output
**
**   Peripheral Pin Select Configuration Bit:
**     IOL1WAY_OFF          Allow Multiple reconfigurations
**     IOL1WAY_ON           Allow Only One reconfiguration
**
**   Clock Switching Mode Bits:
**     FCKSM_CSECME         Both Clock Switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock Switching is enabled,Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock Switching and Fail-safe Clock Monitor are disabled
**
**   PLL Lock Enable Bit:
**     PLLKEN_OFF           Clock switch will not wait for the PLL lock signal
**     PLLKEN_ON            Clock switch to PLL source will wait until the PLL lock signal is valid
**
*/

#define POSCMD_EC            0x01E4
#define POSCMD_XT            0x01E5
#define POSCMD_HS            0x01E6
#define POSCMD_NONE          0x01E7

#define OSCIOFNC_ON          0x01E3
#define OSCIOFNC_OFF         0x01E7

#define IOL1WAY_OFF          0x01C7
#define IOL1WAY_ON           0x01E7

#define FCKSM_CSECME         0x0127
#define FCKSM_CSECMD         0x0167
#define FCKSM_CSDCMD         0x01A7

#define PLLKEN_OFF           0x00E7
#define PLLKEN_ON            0x01E7

/* Register FWDT (0x57a0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0x57a0),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler Bits:
**     WDTPOST_PS1          1:1
**     WDTPOST_PS2          1:2
**     WDTPOST_PS4          1:4
**     WDTPOST_PS8          1:8
**     WDTPOST_PS16         1:16
**     WDTPOST_PS32         1:32
**     WDTPOST_PS64         1:64
**     WDTPOST_PS128        1:128
**     WDTPOST_PS256        1:256
**     WDTPOST_PS512        1:512
**     WDTPOST_PS1024       1:1,024
**     WDTPOST_PS2048       1:2,048
**     WDTPOST_PS4096       1:4,096
**     WDTPOST_PS8192       1:8,192
**     WDTPOST_PS16384      1:16,384
**     WDTPOST_PS32768      1:32,768
**
**   Watchdog Timer Prescaler Bit:
**     WDTPRE_PR32          1:32
**     WDTPRE_PR128         1:128
**
**   Watchdog Timer Enable Bits:
**     FWDTEN_OFF           WDT and SWDTEN Disabled
**     FWDTEN_ON_DIS_SLEEP  WDT Enabled only while device is active (disabled in sleep, SWDTEN disabled)
**     FWDTEN_ON_SWDTEN     WDT Enabled/Disabled (controlled using SWDTEN bit)
**     FWDTEN_ON            WDT Enabled
**
**   Watchdog Timer Window Enable Bit:
**     WINDIS_ON            Watchdog timer in Window Mode
**     WINDIS_OFF           Watchdog timer in Non-Window Mode
**
**   Watchdog Window Select Bits:
**     WDTWIN_WIN75         WDT Window is 75% of WDT period
**     WDTWIN_WIN50         WDT Window is 50% of WDT period
**     WDTWIN_WIN37         WDT Window is 37.5% of WDT period
**     WDTWIN_WIN25         WDT Window is 25% of WDT period
**
*/

#define WDTPOST_PS1          0x03F0
#define WDTPOST_PS2          0x03F1
#define WDTPOST_PS4          0x03F2
#define WDTPOST_PS8          0x03F3
#define WDTPOST_PS16         0x03F4
#define WDTPOST_PS32         0x03F5
#define WDTPOST_PS64         0x03F6
#define WDTPOST_PS128        0x03F7
#define WDTPOST_PS256        0x03F8
#define WDTPOST_PS512        0x03F9
#define WDTPOST_PS1024       0x03FA
#define WDTPOST_PS2048       0x03FB
#define WDTPOST_PS4096       0x03FC
#define WDTPOST_PS8192       0x03FD
#define WDTPOST_PS16384      0x03FE
#define WDTPOST_PS32768      0x03FF

#define WDTPRE_PR32          0x03EF
#define WDTPRE_PR128         0x03FF

#define FWDTEN_OFF           0x039F
#define FWDTEN_ON_DIS_SLEEP  0x03BF
#define FWDTEN_ON_SWDTEN     0x03DF
#define FWDTEN_ON            0x03FF

#define WINDIS_ON            0x037F
#define WINDIS_OFF           0x03FF

#define WDTWIN_WIN75         0x00FF
#define WDTWIN_WIN50         0x01FF
#define WDTWIN_WIN37         0x02FF
#define WDTWIN_WIN25         0x03FF

